garyPenhook/PyAvrOCD/svd/at90pwm1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BOOT_LOAD</name>
      <description>Bootloader</description>
      <baseAddress>0x00800057</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SPMCSR</name>
          <description>Store Program Memory Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPMEN</name>
              <description>Store Program Memory Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGERS</name>
              <description>Page Erase</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGWRT</name>
              <description>Page Write</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLBSET</name>
              <description>Boot Lock Bit Set</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWWSRE</name>
              <description>Read While Write section read enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWWSB</name>
              <description>Read While Write Section Busy</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPMIE</name>
              <description>SPM Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU</name>
      <description>CPU Registers</description>
      <baseAddress>0x00800039</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x5</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1A</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2B</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2D</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RESET</name>
        <description>External Pin, Power-on Reset, Brown-out Reset, Watchdog Reset and JTAG AVR Reset</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>PSC2_CAPT</name>
        <description>PSC2 Capture Event</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>PSC2_EC</name>
        <description>PSC2 End Cycle</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>PSC1_CAPT</name>
        <description>PSC1 Capture Event</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>PSC1_EC</name>
        <description>PSC1 End Cycle</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>PSC0_CAPT</name>
        <description>PSC0 Capture Event</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>PSC0_EC</name>
        <description>PSC0 End Cycle</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>ANALOG_COMP_0</name>
        <description>Analog Comparator 0</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>ANALOG_COMP_1</name>
        <description>Analog Comparator 1</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>ANALOG_COMP_2</name>
        <description>Analog Comparator 2</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>INT0</name>
        <description>External Interrupt Request 0</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_CAPT</name>
        <description>Timer/Counter1 Capture Event</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPA</name>
        <description>Timer/Counter1 Compare Match A</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPB</name>
        <description>Timer/Counter Compare Match B</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>RESERVED15</name>
        <description>No Description.</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_OVF</name>
        <description>Timer/Counter1 Overflow</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_COMP_A</name>
        <description>Timer/Counter0 Compare Match A</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_OVF</name>
        <description>Timer/Counter0 Overflow</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>ADC</name>
        <description>ADC Conversion Complete</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>INT1</name>
        <description>External Interrupt Request 1</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>SPI_STC</name>
        <description>SPI Serial Transfer Complete</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>USART_RX</name>
        <description>USART, Rx Complete</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>USART_UDRE</name>
        <description>USART Data Register Empty</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>USART_TX</name>
        <description>USART, Tx Complete</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>INT2</name>
        <description>External Interrupt Request 2</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>Watchdog Timeout Interrupt</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>EE_READY</name>
        <description>EEPROM Ready</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_COMPB</name>
        <description>Timer Counter 0 Compare Match B</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>INT3</name>
        <description>External Interrupt Request 3</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>RESERVED30</name>
        <description>No Description.</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>RESERVED31</name>
        <description>No Description.</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>SPM_READY</name>
        <description>Store Program Memory Read</description>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>CLKPR</name>
          <description>No Description.</description>
          <addressOffset>0x28</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKPS</name>
              <description>No Description.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKPCE</name>
              <description>No Description.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOR0</name>
          <description>General Purpose IO Register 0</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPIOR00</name>
              <description>General Purpose IO Register 0 bit 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOR01</name>
              <description>General Purpose IO Register 0 bit 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOR02</name>
              <description>General Purpose IO Register 0 bit 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOR03</name>
              <description>General Purpose IO Register 0 bit 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOR04</name>
              <description>General Purpose IO Register 0 bit 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOR05</name>
              <description>General Purpose IO Register 0 bit 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOR06</name>
              <description>General Purpose IO Register 0 bit 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOR07</name>
              <description>General Purpose IO Register 0 bit 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOR1</name>
          <description>General Purpose IO Register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPIOR</name>
              <description>General Purpose IO Register 1 bis</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOR2</name>
          <description>General Purpose IO Register 2</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPIOR</name>
              <description>General Purpose IO Register 2 bis</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOR3</name>
          <description>General Purpose IO Register 3</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPIOR</name>
              <description>General Purpose IO Register 3 bis</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IVCE</name>
              <description>Interrupt Vector Change Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IVSEL</name>
              <description>Interrupt Vector Select</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PUD</name>
              <description>Pull-up disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIPS</name>
              <description>SPI Pin Select</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUSR</name>
          <description>MCU Status Register</description>
          <addressOffset>0x1B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PORF</name>
              <description>Power-on reset flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTRF</name>
              <description>External Reset Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BORF</name>
              <description>Brown-out Reset Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDRF</name>
              <description>Watchdog Reset Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCAL</name>
          <description>Oscillator Calibration Value (read-only for debugger)</description>
          <addressOffset>0x2D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OSCCAL</name>
              <description>Oscillator Calibration </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCSR</name>
          <description>PLL Control And Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLOCK</name>
              <description>PLL Lock Detector</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLE</name>
              <description>PLL Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLF</name>
              <description>PLL Factor</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRR</name>
          <description>Power Reduction Register</description>
          <addressOffset>0x2B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRADC</name>
              <description>Power Reduction ADC</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRUSART0</name>
              <description>Power Reduction USART</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSPI</name>
              <description>Power Reduction Serial Peripheral Interface</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTIM0</name>
              <description>Power Reduction Timer/Counter0</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTIM1</name>
              <description>Power Reduction Timer/Counter1</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRPSC0</name>
              <description>Power Reduction PSC0</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRPSC1</name>
              <description>Power Reduction PSC1</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRPSC2</name>
              <description>Power Reduction PSC2</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMCR</name>
          <description>Sleep Mode Control Register</description>
          <addressOffset>0x1A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SE</name>
              <description>Sleep Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SM</name>
              <description>Sleep Mode Select bits</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>ADC Noise Reduction (If Available)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDOWN</name>
                  <description>Power Down</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>Reserved</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x04</name>
                  <description>Reserved</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x05</name>
                  <description>Reserved</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STDBY</name>
                  <description>Standby</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x07</name>
                  <description>Reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
